In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:Student@127.0.0.1/postgres

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/postgres
5 rows affected.

[(1, 1541903636796, 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, 1541903770796, 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, 1541904034796, 69, 'free', None, None, 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, 1541910973796, 32, 'free', None, None, 456, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (5, 1541911006796, 75, 'free', None, None, 284, 'Columbia, SC', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3) AppleWebKit/537.75.14 (KHTML, like Gecko) Version/7.0.3 Safari/537.75.14"')]

In [4]:
%sql SELECT count(*) FROM songplays;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[(73,)]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/postgres
5 rows affected.

[(69, 'Anabelle', 'Simpson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (75, 'Joseph', 'Gutierrez', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free')]

In [6]:
%sql SELECT count(*) FROM users;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[(15,)]

In [7]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363'))]

In [8]:
%sql SELECT count(*) FROM songs;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[(1,)]

In [9]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN'))]

In [10]:
%sql SELECT count(*) FROM artists;

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[(1,)]

In [11]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/postgres
5 rows affected.

[(1541903636796, 2, 11, 45, 11, 2018, 'Sunday'),
 (1541903770796, 2, 11, 45, 11, 2018, 'Sunday'),
 (1541904034796, 2, 11, 45, 11, 2018, 'Sunday'),
 (1541910973796, 4, 11, 45, 11, 2018, 'Sunday'),
 (1541911006796, 4, 11, 45, 11, 2018, 'Sunday')]

In [12]:
%sql SELECT count(*) FROM time

 * postgresql://postgres:***@127.0.0.1/postgres
1 rows affected.

[(73,)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).